Repository: xkatsar/physiomer
Catalog: sites/all/traductions/commerce_bpc-7.x-1.0-rc5.*.po
Languages: fr

source: Title
fr: Titre

source: Status
fr: Statut

source: Disabled
fr: Désactivé

source: The configuration options have been saved.
fr: Les options de configuration ont été enregistrées.

source: Label
fr: Étiquette

source: Active
fr: Actif

source: SKU
fr: Référence

source: Tokens
fr: Jetons (tokens)

source: Token
fr: Jeton (token)

source: Patterns
fr: Motifs

source: Available Tokens
fr: Jetons (tokens) disponibles

source: Create node
fr: Créer un nœud

source: Disabled products cannot be added to shopping carts and may be hidden in administrative product lists.
fr: Les produits désactivés ne peuvent pas être ajoutés aux paniers et peuvent être cachés dans les listes administratives de produits.

source: Custom redirect path
fr: Redirection personnalisée

source: Create products
fr: Créer des produits

source: SKU Pattern
fr: Motif des références

source: Combinations
fr: Combinaisons

source: Bulk Product Creation Form
fr: Formulaire de création de produits en masse

source: Product Info
fr: Information produit

source: A product will be created for every possible combination of the values you select here.
fr: Un produit sera créé pour chacune des combinaisons possibles des valeurs que vous sélectionnez ici.

source: Static values
fr: Valeurs fixes

source: The values of these fields will be shared by all generated products.
fr: Les valeurs de ces champs seront partagées par tous les produits générés.

source: Desription
fr: Description

source: You may use the following tokens:
fr: Vous pouvez utiliser les jetons (tokens) suivants :

source: Display Node
fr: Nœud d'affichage

source: This pattern yielded one or more invalid SKUs, please use a different pattern. Check for token values that may have spaces.
fr: Ce motif a produit une ou plusieurs références invalides, veuillez utiliser un modèle différent. Attention aux jetons qui contiennent des espaces.

source: This pattern yielded one or more duplicate SKUs, please use a different pattern.
fr: Ce motif a produit une ou plusieurs références identiques. Merci d'utiliser un motif différent.

source: Successfully generated @count new products.
fr: @count nouveaux produits générés avec succès.

source: None of the product types you have created so far are available for bulk creation. In order to be avalable for bulk creation, a product type must have at least one field that supports it, such as a list field. Go to the <a href="@manage-product-types">manage product types page</a> to add fields to your product types.
fr: Aucun des types de produits créés jusqu'à présent n'est disponible pour une création en masse. Afin d'être disponible pour la création en masse, un type de produit doit avoir au minimum un champ qui prend en charge cette fonctionnalité. Allez à <a href="@manage-product-types">la page de gestion des types de produit</a> pour ajouter des champs à votre type de produit.

source: Bulk Product
fr: Produit en masse

source: Tokens related to bulk products.
fr: Jetons (tokens) liés aux produits en masse.

source: Bulk product creation
fr: Création de produits en masse

source: Treat this field as static
fr: Traiter comme champ statique

source: Bulk add products
fr: Ajouter des produits en masse

source: Add a new group of products for sale in bulk.
fr: Ajouter en masse un nouveau groupe de produits à vendre.

source: Bulk add @name
fr: Ajouter @name en masse

source: Commerce (bulk product creation)
fr: Commerce (création de produits en masse)

source: A UI and API which allow for the creation of related products in bulk
fr: Une interface utilisateur et une API qui permet de créer des produits associés en masse

source: Specify the patterns used for the generation of SKUs and titles during bulk creation.
fr: Spécifier les motifs utilisés pour la génération de références et de titres lors de la création en masse.

source: Enter the pattern that should be used to generate SKUs. You should use the patterns below.
fr: Saisissez le motif à utiliser pour générer les références. Vous pouvez utiliser les motifs ci-dessous.

source: Title pattern
fr: Motif du titre

source: Enter the pattern that should be used to generate titles. You should use the patterns below.
fr: Saisissez le motif à utiliser pour générer les titres. Vous pouvez utiliser les motifs ci-dessous.

source: Example variant SKU:
fr: Exemple de référence variable :

source: Example variant title:
fr: Exemple de titre variable :

source: Bulk Product default patterns
fr: Motifs par défaut des produits en masse

source: Tokens related to bulk product creation default patterns
fr: Jetons (tokens) associés aux motifs par défaut pour la création de produits en masse

source: Settings for the bulk product creation functionality
fr: Paramètres pour la fonctionnalité de création de produits en masse

source: Display node creation
fr: Création des nœuds d'affichage

source: How should the creation of display nodes be handled?
fr: Comment doit être gérée la création de nœuds d'affichage ?

source: <strong>Note:</strong> The rest of the settings available on this page depends on what you select here.
fr: <strong>Note :</strong> le reste des paramètres disponibles sur cette page dépend de ce que vous sélectionnez ici.

source: Provide a "Save and create display" link on the Bulk creation form that takes the user to a pre-populated node creation form.
fr: Fournir un lien "Enregistrer et créer un affichage" sur le formulaire de création en masse qui envoie l'utilisateur sur un formulaire de création de nœud pré-rempli.

source: Silently create a display node automatically that references all the created products.
fr: Créer silencieusement et automatiquement un nœud d'affichage qui référence tous les produits créés.

source: Do not include any display node functionality.
fr: N'inclure aucune fonctionnalité de nœud d'affichage.

source: Content type of the created display node
fr: Type de contenu du nœud d'affichage créé

source: In order to auto-generate display nodes for all product types, you must create at least one content type that has a product reference field that can reference all product types. Visit the <a href="@content_type_path">content type page</a> to add such a field to a content type.
fr: Afin de générer automatiquement les nœuds de visualisation pour tous les types de produits, vous devez créer au moins un type de contenu comportant un champ de référencement de produit qui peut référencer tous les types de produits. Visiter la <a href="@content_type_path">page du type de contenu</a> pour ajouter un tel champ à un type de contenu.

source: Pattern for the title of the created display node
fr: Motif du titre du nœud d'affichage créé

source: You can use the token %title_fragment_token for the title fragment entered by the user on the bulk creation form.
fr: Vous pouvez utiliser le jeton %title_fragment_token pour le fragment de titre saisi par l'utilisateur sur le formulaire de création en masse.

source: ... the list of products.
fr: ... la liste des produits.

source: ... the newly created display node.
fr: ... le nœud d'affichage nouvellement créé.

source: ... a custom location.
fr: ... un emplacement personnalisé.

source: Display node settings
fr: Paramètres des nœuds d'affichage

source: Settings for the bulk product creation display node settings
fr: Paramètres d'affichage des nœuds produits créés en masse

source: The internal value of the @field_label field
fr: La valeur interne du champ @field_label

source: Term reference fields can either be used to create combinations, or can be set to be static, in which case all bulk-created products will share the same value for the field.
fr: Les champs de référencement de termes peuvent être utilisés pour créer des combinaisons ou bien peuvent être définis comme statiques, auquel cas tous les produits créés en masse partageront la même valeur pour le champ.

source: Commerce bulk product creation - Taxonomy reference integration
fr: Création en masse de produits Commerce - Intégration des références à la taxonomie

source: Create a display node automatically for every product created.
fr: Créer automatiquement un nœud d'affichage pour tout produit créé.

source: Settings for created display nodes
fr: Paramètres des nœuds d'affichage créés

source: The setting <strong>--Allow user to select node type--</strong> is only valid for manual node creation.
fr: La paramètre <strong>--Permettre à l'utilisateur de sélectionner le type de nœud--</strong> n'est valide que pour la création manuelle de nœuds.

source: --Allow user to select node type--
fr: --Permettre à l'utilisateur de sélectionner le type de nœud--

source: Bulk Product Creation Form - Choose Display Node type
fr: Formulaire de création en masse de produits - Choisir le type de nœud d'affichage

source: Override settings for type %label
fr: Supplanter les paramètres du type %label
