Repository: xkatsar/physiomer
Catalog: sites/all/traductions/commerce_product_attributes-7.x-1.0-beta3.*.po
Languages: fr

source: Update cart
fr: Mettre à jour le panier

source: %title could not be updated.
fr: %title n'a pas pu être mis à jour.

source: Attribute View
fr: Vue Attribut

source: Product Attributes
fr: Attributs Produit

source: Enables the display of product attributes in the shopping cart view.
fr: Active l'affichage des attributs de produits dans la vue Panier.

source: Display all the product attributes for the line item.
fr: Afficher tous les attributs de produit pour la ligne article

source: Link to Product
fr: Lien vers le produit

source: Check this if the product title should be linked with the product display.
fr: Cocher cette case si le titre du produit doit être lié à l'affichage du produit.

source: Link With Line Item
fr: Lien avec la ligne de commande

source: Check this if link should contain the line item. This allow the editing of the line item by the customer.
fr: Cocher cette case si le lien doit contenir la ligne de commande. Cela permet la modification de la ligne de commande par le client.

source: %title is updated in <a href="!cart-url">your cart</a>.
fr: %title est mis à jour dans <a href="!cart-url">votre panier</a>.
